import { setMsgHandler } from "../../pi/net/ui/con_mgr";
import { popNewMessage } from "../utils/tools";

/**
 * 后端主动推消息给后端
 */
// ===================================================== 导入
// ===================================================== 导出
// ===================================================== 本地

// ===================================================== 立即执行

//主动推送
export const initPush = ()=>{
    setMsgHandler('event_pay_ok',(res)=>{
        popNewMessage('充值已到账');
        console.log('服务器推送成功==========================',res);
    });
}
