import {Widget} from "../../../pi/widget/widget";
import {notify} from "../../../pi/widget/event";
import { popNew } from "../../../pi/ui/root";

export class messageList extends Widget{
    public ok: () => void;
    constructor(){
        super();
        this.props={
            checkedIndex:0,
            data:[
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题哈哈哈哈题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"},
                {type:"公告",title:"标题标题标题标题标题标题标题标题标题标题标题标题标题标题", content:"这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容这是内容",time:"4-5"}
            ]
        }
    }

    public backPrePage(){
        this.ok && this.ok();
    }

    public messDetail(event,index){
        window.sessionStorage.item = JSON.stringify(this.props.data[index]);
        popNew("app-view-messageList-messageItem");
    }
}